<a href="https://www.kaggle.com/code/bunniebytes/ctd-assignment-6?scriptVersionId=291013018" target="_blank"><img align="left" alt="Kaggle" title="Open in Kaggle" src="https://kaggle.com/static/images/open-in-kaggle.svg"></a>

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import warnings

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/ai-powered-job-recommendations/job_recommendation_dataset.csv
/kaggle/input/code-the-dream-lesson-5/fake_data.csv
/kaggle/input/ecommerce-consumer-behavior-analysis-data/Ecommerce_Consumer_Behavior_Analysis_Data.csv
/kaggle/input/code-the-dream-eclipses/eclipses.csv

## Task 1: Practice Pivot Tables

In [2]:
warnings.filterwarnings('ignore')
ecommerce = pd.read_csv("/kaggle/input/ecommerce-consumer-behavior-analysis-data/Ecommerce_Consumer_Behavior_Analysis_Data.csv")
display(ecommerce.head())

ecommerce["Purchase_Amount"] = pd.to_numeric(ecommerce["Purchase_Amount"].str.replace("$", "", regex = False), errors = "coerce")

buying_patterns = pd.pivot_table(ecommerce, index = "Purchase_Category", columns = ["Gender", "Income_Level"], values = "Purchase_Amount", aggfunc = "sum")
display(buying_patterns)

demographics = pd.pivot_table(ecommerce, index = ["Income_Level", "Education_Level"], columns = "Marital_Status", values = "Customer_ID", aggfunc = "count")
display(demographics)

,Customer_ID,Age,Gender,Income_Level,Marital_Status,Education_Level,Occupation,Location,Purchase_Category,Purchase_Amount,...,Customer_Satisfaction,Engagement_with_Ads,Device_Used_for_Shopping,Payment_Method,Time_of_Purchase,Discount_Used,Customer_Loyalty_Program_Member,Purchase_Intent,Shipping_Preference,Time_to_Decision
0,37-611-6911,22,Female,Middle,Married,Bachelor's,Middle,Évry,Gardening & Outdoors,$333.80,...,7,NaN,Tablet,Credit Card,3/1/2024,True,False,Need-based,No Preference,2
1,29-392-9296,49,Male,High,Married,High School,High,Huocheng,Food & Beverages,$222.22,...,5,High,Tablet,PayPal,4/16/2024,True,False,Wants-based,Standard,6
2,84-649-5117,24,Female,Middle,Single,Master's,High,Huzhen,Office Supplies,$426.22,...,7,Low,Smartphone,Debit Card,3/15/2024,True,True,Impulsive,No Preference,3
3,48-980-6078,29,Female,Middle,Single,Master's,Middle,Wiwilí,Home Appliances,$101.31,...,1,NaN,Smartphone,Other,10/4/2024,True,True,Need-based,Express,10
4,91-170-9072,33,Female,Middle,Widowed,High School,Middle,Nara,Furniture,$211.70,...,10,NaN,Smartphone,Debit Card,1/30/2024,False,False,Wants-based,No Preference,4

Gender                    Agender         Bigender           Female           \
Income_Level                 High  Middle     High  Middle     High   Middle
Purchase_Category
Animal Feed                229.30     NaN      NaN     NaN  2225.60  2926.62
Arts & Crafts                 NaN  158.54    70.42     NaN  2442.19  1415.83
Baby Products                 NaN     NaN   308.58     NaN  3408.17  1904.55
Beauty & Personal Care     108.61     NaN      NaN  108.50  3367.92  1177.15
Books                         NaN     NaN      NaN     NaN  3856.56  1050.90
Clothing                   198.89     NaN      NaN  249.73  1649.55  1291.34
Electronics                   NaN     NaN   596.22     NaN  4461.89  2462.04
Food & Beverages              NaN     NaN   253.29  364.48  4334.07  2420.21
Furniture                     NaN     NaN   363.84  328.36  1927.53  3524.22
Gardening & Outdoors          NaN     NaN      NaN  128.48  1685.18  2977.86
Groceries                  491.92   61.19      NaN  339.32  2201.02  2632.85
Health Care                   NaN     NaN   474.42     NaN  3922.30  3005.95
Health Supplements            NaN  354.16   254.83     NaN  2185.65  1384.55
Home Appliances            607.73  604.66      NaN     NaN  1923.49  1834.20
Hotels                     182.89     NaN      NaN     NaN  2423.13  2135.41
Jewelry & Accessories         NaN     NaN      NaN     NaN  4195.20  4583.73
Luxury Goods                  NaN     NaN      NaN     NaN  4210.50  2513.93
Mobile Accessories            NaN     NaN      NaN     NaN  1730.11  2837.92
Office Supplies               NaN     NaN      NaN     NaN  2343.28  2811.88
Packages)                  720.21  301.16   305.54     NaN  4164.35  2981.56
Software & Apps            414.06     NaN   490.11     NaN  2725.61  2403.34
Sports & Outdoors             NaN     NaN   418.83  114.44  3254.30  2612.80
Toys & Games                  NaN     NaN      NaN     NaN  2694.02  4690.20
Travel & Leisure (Flights     NaN  198.45      NaN     NaN    58.27  2534.78

Gender                    Genderfluid         Genderqueer             Male  \
Income_Level                     High  Middle        High  Middle     High
Purchase_Category
Animal Feed                       NaN     NaN         NaN  443.52  2897.24
Arts & Crafts                     NaN     NaN         NaN     NaN  1783.82
Baby Products                  435.37     NaN         NaN     NaN  3201.86
Beauty & Personal Care            NaN     NaN      157.21     NaN  1283.71
Books                             NaN     NaN         NaN     NaN  2454.85
Clothing                          NaN  964.10         NaN     NaN  1204.83
Electronics                    358.50     NaN         NaN     NaN  2973.35
Food & Beverages                  NaN     NaN      395.01     NaN  2564.28
Furniture                      268.28     NaN      209.79     NaN  1592.55
Gardening & Outdoors              NaN     NaN      446.92     NaN  3706.36
Groceries                         NaN  447.53      142.43  374.36  2535.68
Health Care                    333.32     NaN         NaN     NaN  1456.22
Health Supplements                NaN     NaN      156.40     NaN  2963.05
Home Appliances                148.98     NaN         NaN     NaN  3349.16
Hotels                            NaN     NaN         NaN     NaN  1615.44
Jewelry & Accessories             NaN  457.18         NaN     NaN  3920.74
Luxury Goods                      NaN     NaN         NaN  324.39   658.12
Mobile Accessories             282.13     NaN         NaN     NaN  4203.13
Office Supplies                241.72     NaN         NaN     NaN  1402.11
Packages)                       52.79  347.51         NaN     NaN  1298.42
Software & Apps                   NaN  227.47      104.74     NaN  3003.42
Sports & Outdoors                 NaN     NaN      157.26     NaN  2114.66
Toys & Games                   207.18     NaN         NaN     NaN  3451.97
Travel & Leisure (Flights      246.74     NaN      442.18     NaN  2627.00

Gender                             Non-binary         Polygender
Income_Level                Middle       High  Middle       High  Middle
Purchase_Category
Animal Feed                2300.77        NaN  444.05        NaN     NaN
Arts & Crafts              1250.59     111.24  297.29        NaN     NaN
Baby Products              1913.99        NaN     NaN        NaN     NaN
Beauty & Personal Care     1741.91        NaN     NaN        NaN     NaN
Books                      3760.38        NaN     NaN        NaN     NaN
Clothing                   2400.31     442.29     NaN        NaN     NaN
Electronics                2461.18        NaN  101.29     427.94     NaN
Food & Beverages           2388.57        NaN  247.05        NaN     NaN
Furniture                  2067.72        NaN     NaN        NaN     NaN
Gardening & Outdoors       2837.48        NaN     NaN        NaN     NaN
Groceries                  2241.35        NaN     NaN        NaN     NaN
Health Care                2448.33     375.45     NaN        NaN  133.04
Health Supplements         3069.41        NaN     NaN     540.26     NaN
Home Appliances            4233.26     490.34     NaN        NaN     NaN
Hotels                     2107.28        NaN     NaN        NaN  390.83
Jewelry & Accessories       881.30        NaN  323.40     777.81     NaN
Luxury Goods               2343.43     196.63     NaN        NaN     NaN
Mobile Accessories         1719.97     307.61  608.31        NaN     NaN
Office Supplies            3461.64     268.93     NaN        NaN  305.45
Packages)                  2090.92     306.48     NaN     162.22     NaN
Software & Apps            3935.21        NaN     NaN        NaN  297.45
Sports & Outdoors          5374.37        NaN   83.33        NaN  480.52
Toys & Games               2400.66        NaN     NaN        NaN   92.43
Travel & Leisure (Flights  2468.69        NaN     NaN     552.79  460.88

Marital_Status                Divorced  Married  Single  Widowed
Income_Level Education_Level
High         Bachelor's             47       44      48       39
             High School            43       46      39       47
             Master's               46       36      40       40
Middle       Bachelor's             42       49      30       42
             High School            31       31      44       50
             Master's               36       47      41       42

## Task 2: Practice apply()

In [3]:
jobs = pd.read_csv("/kaggle/input/ai-powered-job-recommendations/job_recommendation_dataset.csv")
display(jobs.head(10))

def is_entry_level(row):
    skills = row["Required Skills"].replace(" ", "").split(",")
    if row["Experience Level"] == "Entry Level" and row["Salary"] >= 70000 and "SQL" in skills and "Python" in skills:
        return "Yes"
    return "No"

jobs["Check These Out"] = jobs.apply(is_entry_level, axis = 1)

my_jobs = jobs[jobs["Check These Out"] == "Yes"]
display(my_jobs.head(10))

,Job Title,Company,Location,Experience Level,Salary,Industry,Required Skills
0,Early years teacher,Richardson Ltd,Sydney,Senior Level,87000.0,Healthcare,Pharmaceuticals
1,Counselling psychologist,"Ramos, Santiago and Stewart",San Francisco,Mid Level,50000.0,Marketing,"Google Ads, SEO, Content Writing"
2,Radio broadcast assistant,Franco Group,New York,Mid Level,77000.0,Healthcare,"Patient Care, Nursing, Medical Research, Pharm..."
3,"Designer, exhibition/display",Collins Inc,Berlin,Senior Level,90000.0,Software,Machine Learning
4,"Psychotherapist, dance movement",Barker Group,Sydney,Entry Level,112000.0,Healthcare,"Nursing, Medical Research, Pharmaceuticals"
5,Early years teacher,Dawson-Hudson,Sydney,Mid Level,93000.0,Finance,"Financial Modeling, Risk Analysis"
6,Academic librarian,Clark Ltd,London,Entry Level,104000.0,Healthcare,Pharmaceuticals
7,Quantity surveyor,Dean-Delacruz,Sydney,Entry Level,123000.0,Software,"Java, Python"
8,Archaeologist,Williams LLC,New York,Senior Level,102000.0,Finance,"Python, SQL, Risk Analysis"
9,Mining engineer,Berg LLC,London,Senior Level,67000.0,Manufacturing,Production Planning

,Job Title,Company,Location,Experience Level,Salary,Industry,Required Skills,Check These Out
73,Charity fundraiser,"Lara, Greene and White",London,Entry Level,82000.0,Finance,"SQL, Python, Excel, Risk Analysis",Yes
204,Corporate investment banker,Webb Ltd,San Francisco,Entry Level,138000.0,Finance,"Python, Risk Analysis, Financial Modeling, SQL",Yes
210,Accounting technician,Jones-Brock,Toronto,Entry Level,97000.0,Finance,"SQL, Risk Analysis, Excel, Python",Yes
241,"Surveyor, planning and development",Anderson-Hernandez,London,Entry Level,112000.0,Software,"React, SQL, Machine Learning, Python",Yes
274,Fitness centre manager,"Berry, Phillips and Harper",Bangalore,Entry Level,131000.0,Software,"C++, SQL, Java, Python",Yes
292,Media buyer,Daniels and Sons,San Francisco,Entry Level,104000.0,Finance,"Python, Financial Modeling, Risk Analysis, SQL",Yes
315,Civil Service fast streamer,White-Robertson,Sydney,Entry Level,136000.0,Software,"SQL, Python",Yes
523,Insurance underwriter,"Duran, King and Morales",Berlin,Entry Level,124000.0,Finance,"Python, Risk Analysis, SQL, Financial Modeling",Yes
603,"Production assistant, radio",Barber-Hamilton,Bangalore,Entry Level,118000.0,Finance,"Python, Financial Modeling, SQL",Yes
631,"Geologist, engineering",Obrien-Wright,Berlin,Entry Level,134000.0,Finance,"Risk Analysis, Python, SQL",Yes

## Task 3: Handling Missing Data

In [4]:
df = pd.read_csv("/kaggle/input/code-the-dream-lesson-5/fake_data.csv")
display(df)

df1 = df.dropna()
display(df.info())
display(df1.info())

values = {"Name" : "Unknown", "Age" : df["Age"].mean(), "Salary" : df["Salary"].median(), "Join Date" : "2020-01-01"}
df.fillna(value = values, inplace = True)
display(df)

df2 = df.dropna(ignore_index = True).astype({"Age" : int})
display(df2)

        Name    Age  Salary   Join Date           City
0    Richard   87.0   63463  2002-04-13             LA
1       Dana   53.0   99436  2004-09-13            NaN
2    Theresa   45.0   93870  2019-02-08        Chicago
3    Kristin   30.0   70462  2021-12-27        Chicago
4      Kevin   91.0   92534  2001-07-14        Houston
..       ...    ...     ...         ...            ...
995   Joseph   34.0   65600  2010-11-20        Chicago
996    Sarah   -1.0   93884  2021-06-05        Chicago
997    April   22.0   66933  2021-11-09            NaN
998   Sharon  120.0   77361  2009-07-25             LA
999    Larry  104.0   84461  2003-11-26  New York City

[1000 rows x 5 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       962 non-null    object
 1   Age        895 non-null    float64
 2   Salary     1000 non-null   int64
 3   Join Date  1000 non-null   object
 4   City       899 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 39.2+ KB

None

<class 'pandas.core.frame.DataFrame'>
Index: 775 entries, 0 to 999
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       775 non-null    object
 1   Age        775 non-null    float64
 2   Salary     775 non-null    int64
 3   Join Date  775 non-null    object
 4   City       775 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 36.3+ KB

None

        Name    Age  Salary   Join Date           City
0    Richard   87.0   63463  2002-04-13             LA
1       Dana   53.0   99436  2004-09-13            NaN
2    Theresa   45.0   93870  2019-02-08        Chicago
3    Kristin   30.0   70462  2021-12-27        Chicago
4      Kevin   91.0   92534  2001-07-14        Houston
..       ...    ...     ...         ...            ...
995   Joseph   34.0   65600  2010-11-20        Chicago
996    Sarah   -1.0   93884  2021-06-05        Chicago
997    April   22.0   66933  2021-11-09            NaN
998   Sharon  120.0   77361  2009-07-25             LA
999    Larry  104.0   84461  2003-11-26  New York City

[1000 rows x 5 columns]

        Name  Age  Salary   Join Date           City
0    Richard   87   63463  2002-04-13             LA
1    Theresa   45   93870  2019-02-08        Chicago
2    Kristin   30   70462  2021-12-27        Chicago
3      Kevin   91   92534  2001-07-14        Houston
4     Joshua   51   75929  2003-01-10        Chicago
..       ...  ...     ...         ...            ...
894    Brent   55   87608  2007-08-06            NYC
895   Joseph   34   65600  2010-11-20        Chicago
896    Sarah   -1   93884  2021-06-05        Chicago
897   Sharon  120   77361  2009-07-25             LA
898    Larry  104   84461  2003-11-26  New York City

[899 rows x 5 columns]

## Task 4: Data Transformation

In [5]:
df3 = pd.read_csv("/kaggle/input/code-the-dream-eclipses/eclipses.csv", sep = "|")
display(df3.info())
display(df3.head())

df3["Date"] = pd.to_datetime(df3["Date"], errors= "coerce")
display(df3.head(20))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    110 non-null    object
 1   Type    110 non-null    object
dtypes: object(2)
memory usage: 1.8+ KB

None

              Date     Type
0  August 30, 1905  Partial
1  January 3, 1908  Partial
2    June 28, 1908  Partial
3    June 17, 1909  Partial
4   April 28, 1911  Partial

         Date     Type
0  1905-08-30  Partial
1  1908-01-03  Partial
2  1908-06-28  Partial
3  1909-06-17  Partial
4  1911-04-28  Partial
5  1912-04-17  Partial
6  1912-10-10  Partial
7  1916-02-03  Partial
8         NaT    Total
9  1918-06-08    Total
10 1919-11-22  Partial
11 1920-11-10  Partial
12 1923-09-10  Partial
13 1925-01-24  Partial
14 1926-07-09  Partial
15        NaT    Total
16 1930-04-28  Partial
17 1932-08-31  Partial
18 1935-02-03  Partial
19 1939-04-19  Partial

## Task 5: Removing Duplicates

In [6]:
display(df3.info())
duplicate_series = df3.duplicated()
print(duplicate_series[duplicate_series == True].head(10))
print(duplicate_series.value_counts())
df3.drop_duplicates(inplace = True)
display(df3.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    108 non-null    datetime64[ns]
 1   Type    110 non-null    object
dtypes: datetime64[ns](1), object(1)
memory usage: 1.8+ KB

None

15    True
48    True
49    True
50    True
51    True
52    True
53    True
54    True
55    True
56    True
dtype: bool
False    85
True     25
Name: count, dtype: int64
<class 'pandas.core.frame.DataFrame'>
Index: 85 entries, 0 to 109
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    84 non-null     datetime64[ns]
 1   Type    85 non-null     object
dtypes: datetime64[ns](1), object(1)
memory usage: 2.0+ KB

None

## Task 6: Handling Outliers

In [7]:
outliers = (df2["Age"] > 100) | (df2["Age"] < 0)
median_age = int(df2[(df2["Age"] < 100) & (df2["Age"] > 0)]["Age"].median())

df2.loc[outliers, "Age"] = median_age
display(df2)

        Name  Age  Salary   Join Date           City
0    Richard   87   63463  2002-04-13             LA
1    Theresa   45   93870  2019-02-08        Chicago
2    Kristin   30   70462  2021-12-27        Chicago
3      Kevin   91   92534  2001-07-14        Houston
4     Joshua   51   75929  2003-01-10        Chicago
..       ...  ...     ...         ...            ...
894    Brent   55   87608  2007-08-06            NYC
895   Joseph   34   65600  2010-11-20        Chicago
896    Sarah   55   93884  2021-06-05        Chicago
897   Sharon   55   77361  2009-07-25             LA
898    Larry   55   84461  2003-11-26  New York City

[899 rows x 5 columns]

## Task 7: Standardizing Data

In [8]:
df2["Name"] = df2["Name"].str.lower().str.strip()
display(df2)

replace_map = {"NYC" : "New York City", "LA" : "Los Angeles"}
df2["City"] = df2["City"].replace(replace_map)
display(df2)

        Name  Age  Salary   Join Date           City
0    richard   87   63463  2002-04-13             LA
1    theresa   45   93870  2019-02-08        Chicago
2    kristin   30   70462  2021-12-27        Chicago
3      kevin   91   92534  2001-07-14        Houston
4     joshua   51   75929  2003-01-10        Chicago
..       ...  ...     ...         ...            ...
894    brent   55   87608  2007-08-06            NYC
895   joseph   34   65600  2010-11-20        Chicago
896    sarah   55   93884  2021-06-05        Chicago
897   sharon   55   77361  2009-07-25             LA
898    larry   55   84461  2003-11-26  New York City

[899 rows x 5 columns]

        Name  Age  Salary   Join Date           City
0    richard   87   63463  2002-04-13    Los Angeles
1    theresa   45   93870  2019-02-08        Chicago
2    kristin   30   70462  2021-12-27        Chicago
3      kevin   91   92534  2001-07-14        Houston
4     joshua   51   75929  2003-01-10        Chicago
..       ...  ...     ...         ...            ...
894    brent   55   87608  2007-08-06  New York City
895   joseph   34   65600  2010-11-20        Chicago
896    sarah   55   93884  2021-06-05        Chicago
897   sharon   55   77361  2009-07-25    Los Angeles
898    larry   55   84461  2003-11-26  New York City

[899 rows x 5 columns]

## Task 8: Validating Data Ranges

In [9]:
invalid_age = (df2["Age"] < 18) | (df2["Age"] > 65)
nan = np.nan
df2.loc[invalid_age, "Age"] = nan
display(df2)

df2["Age"] = df2["Age"].fillna(median_age)
display(df2)

        Name   Age  Salary   Join Date           City
0    richard   NaN   63463  2002-04-13    Los Angeles
1    theresa  45.0   93870  2019-02-08        Chicago
2    kristin  30.0   70462  2021-12-27        Chicago
3      kevin   NaN   92534  2001-07-14        Houston
4     joshua  51.0   75929  2003-01-10        Chicago
..       ...   ...     ...         ...            ...
894    brent  55.0   87608  2007-08-06  New York City
895   joseph  34.0   65600  2010-11-20        Chicago
896    sarah  55.0   93884  2021-06-05        Chicago
897   sharon  55.0   77361  2009-07-25    Los Angeles
898    larry  55.0   84461  2003-11-26  New York City

[899 rows x 5 columns]

        Name   Age  Salary   Join Date           City
0    richard  55.0   63463  2002-04-13    Los Angeles
1    theresa  45.0   93870  2019-02-08        Chicago
2    kristin  30.0   70462  2021-12-27        Chicago
3      kevin  55.0   92534  2001-07-14        Houston
4     joshua  51.0   75929  2003-01-10        Chicago
..       ...   ...     ...         ...            ...
894    brent  55.0   87608  2007-08-06  New York City
895   joseph  34.0   65600  2010-11-20        Chicago
896    sarah  55.0   93884  2021-06-05        Chicago
897   sharon  55.0   77361  2009-07-25    Los Angeles
898    larry  55.0   84461  2003-11-26  New York City

[899 rows x 5 columns]